package cn.edu.ctgu.bishi.shunfeng.shunfeng.h3;

/**
 * 时间限制： 3000MS
 * 内存限制： 589824KB
 * 题目描述：
 * 受到新考古发现的影响，小B最近迷上了考古，帮助考古学家根据已有的发现推测古时的一些建筑结构设计。
 *
 *
 *
 * 最新某个区域中发现了古代祭祀场所的遗址，根据考古学者的研究，该遗址所在时代的祭祀场所通常设计为正多边形，但场所的大小和多边形角度因规模而异。多边形的每个角上设置有一个柱子，柱子之间通过绳子连接。
 *
 *
 *
 * 新近出土的遗址由于受到破坏的原因，只发现了三个柱子，其余的柱子则湮灭在历史的时间长河中。
 *
 *
 *
 * 根据已知的柱子坐标，考古学者请小B帮忙计算祭祀场所可能的最小面积。
 *
 *
 *
 * 输入描述
 * 输入的第一行为一个正整数T，表示有T组测试数据。每组测试数据有三行数据，每行为一个柱子的坐标，其绝对值不超过1000。坐标为浮点数表示，最多保留6位小数。
 *
 * 输出描述
 * 对每组测试数据，在单独的一行里输出可能的最小面积，请保留6位小数。已知正多边形的角点数不超过100个。
 *
 *
 * 样例输入
 * 1
 *
 * 0.000000 0.000000
 *
 * 1.000000 1.000000
 *
 * 0.000000 1.000000
 *
 * 样例输出
 * 1.000000
 * @author NiuQun
 * @date 2021/10/24
 */
public class Main {

}
